michaelng1129/ArduinoCore-GD32V/system/gd32vw55x/sdk/MSDK/projects/cmake/GD32VW553x.svd
        <register>
          <name>GCMCCMCTXS6</name>
          <description>GCM or CCM mode context switch register 6</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CTXx</name>
              <description>The internal status of the CAU core</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GCMCCMCTXS7</name>
          <description>GCM or CCM mode context switch register 7</description>
          <addressOffset>0x6C</addressOffset>
          <size>32</size>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CTXx</name>
              <description>The internal status of the CAU core</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GCMCTXS0</name>
          <description>GCM mode context switch register 0</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CTXx</name>
              <description>The internal status of the CAU core</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GCMCTXS1</name>
          <description>GCM mode context switch register 1</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CTXx</name>
              <description>The internal status of the CAU core</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GCMCTXS2</name>
          <description>GCM mode context switch register 2</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CTXx</name>
              <description>The internal status of the CAU core</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GCMCTXS3</name>
          <description>GCM mode context switch register 3</description>
          <addressOffset>0x7C</addressOffset>
          <size>32</size>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CTXx</name>
              <description>The internal status of the CAU core</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GCMCTXS4</name>
          <description>GCM mode context switch register 4</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CTXx</name>
              <description>The internal status of the CAU core</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GCMCTXS5</name>
          <description>GCM mode context switch register 5</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CTXx</name>
              <description>The internal status of the CAU core</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GCMCTXS6</name>
          <description>GCM mode context switch register 6</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CTXx</name>
              <description>The internal status of the CAU core</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GCMCTXS7</name>
          <description>GCM mode context switch register 7</description>
          <addressOffset>0x8C</addressOffset>
          <size>32</size>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CTXx</name>
              <description>The internal status of the CAU core</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
