michaelng1129/ArduinoCore-GD32V/system/gd32vw55x/sdk/MSDK/projects/cmake/GD32VW553x.svd
        <register>
          <name>CH7M0ADDR</name>
          <description>Channel 7 memory 0 base address register</description>
          <addressOffset>0xC4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>M0ADDR</name>
              <description>Memory 0 base address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CH7M1ADDR</name>
          <description>Channel 7 memory 1 base address register</description>
          <addressOffset>0xC8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>M1ADDR</name>
              <description>Memory 1 base address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CH7FCTL</name>
          <description>Channel 7 FIFO control register</description>
          <addressOffset>0xCC</addressOffset>
          <size>32</size>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FCCV</name>
              <description>FIFO counter critical value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MDMEN</name>
              <description>Multi-data mode enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FCNT</name>
              <description>FIFO counter</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FEEIE</name>
              <description>Enable bit for FIFO error and exception interrupt</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>ECLIC</name>
      <description>Enhanced Core Local Interrupt Controller</description>
      <baseAddress>0xD2000000</baseAddress>
      <!-- addressBlock size estimated: not listed in User Manual Table 1-2 -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CLICCFG</name>
          <description>cliccfg Register</description>
          <addressOffset>0x0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NLBITS</name>
              <description>NLBITS</description>
              <bitOffset>1</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINFO</name>
          <description>clicinfo Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NUM_INTERRUPT</name>
              <description>NUM_INTERRUPT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
            <field>
              <name>VERSION</name>
              <description>VERSION</description>
              <bitOffset>13</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>CLICINTCTLBITS</name>
              <description>CLICINTCTLBITS</description>
              <bitOffset>21</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MTH</name>
          <description>MTH Register</description>
          <addressOffset>0xB</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MTH</name>
              <description>MTH</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTIP_0</name>
          <description>clicintip Register</description>
          <addressOffset>0x1000</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTIP_1</name>
          <description>clicintip Register</description>
          <addressOffset>0x1004</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTIP_2</name>
          <description>clicintip Register</description>
          <addressOffset>0x1008</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTIP_3</name>
          <description>clicintip Register</description>
          <addressOffset>0x100C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTIP_4</name>
          <description>clicintip Register</description>
          <addressOffset>0x1010</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTIP_5</name>
          <description>clicintip Register</description>
          <addressOffset>0x1014</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTIP_6</name>
          <description>clicintip Register</description>
          <addressOffset>0x1018</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTIP_7</name>
          <description>clicintip Register</description>
          <addressOffset>0x101C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTIP_8</name>
          <description>clicintip Register</description>
          <addressOffset>0x1020</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTIP_9</name>
          <description>clicintip Register</description>
          <addressOffset>0x1024</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTIP_10</name>
          <description>clicintip Register</description>
          <addressOffset>0x1028</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTIP_11</name>
          <description>clicintip Register</description>
          <addressOffset>0x102C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTIP_12</name>
          <description>clicintip Register</description>
          <addressOffset>0x1030</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTIP_13</name>
          <description>clicintip Register</description>
          <addressOffset>0x1034</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTIP_14</name>
          <description>clicintip Register</description>
          <addressOffset>0x1038</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTIP_15</name>
          <description>clicintip Register</description>
          <addressOffset>0x103C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTIP_16</name>
          <description>clicintip Register</description>
          <addressOffset>0x1040</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTIP_17</name>
          <description>clicintip Register</description>
          <addressOffset>0x1044</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTIP_18</name>
          <description>clicintip Register</description>
          <addressOffset>0x1048</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTIP_19</name>
          <description>clicintip Register</description>
          <addressOffset>0x104C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTIP_20</name>
          <description>clicintip Register</description>
          <addressOffset>0x1050</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTIP_21</name>
          <description>clicintip Register</description>
          <addressOffset>0x1054</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTIP_22</name>
          <description>clicintip Register</description>
          <addressOffset>0x1058</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTIP_23</name>
          <description>clicintip Register</description>
          <addressOffset>0x105C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTIP_24</name>
          <description>clicintip Register</description>
          <addressOffset>0x1060</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTIP_25</name>
          <description>clicintip Register</description>
          <addressOffset>0x1064</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTIP_26</name>
          <description>clicintip Register</description>
          <addressOffset>0x1068</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTIP_27</name>
          <description>clicintip Register</description>
          <addressOffset>0x106C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTIP_28</name>
          <description>clicintip Register</description>
          <addressOffset>0x1070</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTIP_29</name>
          <description>clicintip Register</description>
          <addressOffset>0x1074</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTIP_30</name>
          <description>clicintip Register</description>
          <addressOffset>0x1078</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTIP_31</name>
          <description>clicintip Register</description>
          <addressOffset>0x107C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTIP_32</name>
          <description>clicintip Register</description>
          <addressOffset>0x1080</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTIP_33</name>
          <description>clicintip Register</description>
          <addressOffset>0x1084</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IP</name>
              <description>IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
