michaelng1129/ArduinoCore-GD32V/system/gd32vw55x/sdk/MSDK/projects/cmake/GD32VW553x.svd
        <register>
          <name>CLICINTATTR_43</name>
          <description>clicintattr Register</description>
          <addressOffset>0x10AE</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHV</name>
              <description>SHV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRIG</name>
              <description>TRIG</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTATTR_44</name>
          <description>clicintattr Register</description>
          <addressOffset>0x10B2</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHV</name>
              <description>SHV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRIG</name>
              <description>TRIG</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTATTR_45</name>
          <description>clicintattr Register</description>
          <addressOffset>0x10B6</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHV</name>
              <description>SHV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRIG</name>
              <description>TRIG</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTATTR_46</name>
          <description>clicintattr Register</description>
          <addressOffset>0x10BA</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHV</name>
              <description>SHV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRIG</name>
              <description>TRIG</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTATTR_47</name>
          <description>clicintattr Register</description>
          <addressOffset>0x10BE</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHV</name>
              <description>SHV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRIG</name>
              <description>TRIG</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTATTR_48</name>
          <description>clicintattr Register</description>
          <addressOffset>0x10C2</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHV</name>
              <description>SHV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRIG</name>
              <description>TRIG</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTATTR_49</name>
          <description>clicintattr Register</description>
          <addressOffset>0x10C6</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHV</name>
              <description>SHV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRIG</name>
              <description>TRIG</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTATTR_50</name>
          <description>clicintattr Register</description>
          <addressOffset>0x10CA</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHV</name>
              <description>SHV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRIG</name>
              <description>TRIG</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTATTR_51</name>
          <description>clicintattr Register</description>
          <addressOffset>0x10CE</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHV</name>
              <description>SHV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRIG</name>
              <description>TRIG</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTATTR_52</name>
          <description>clicintattr Register</description>
          <addressOffset>0x10D2</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHV</name>
              <description>SHV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRIG</name>
              <description>TRIG</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTATTR_53</name>
          <description>clicintattr Register</description>
          <addressOffset>0x10D6</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHV</name>
              <description>SHV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRIG</name>
              <description>TRIG</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTATTR_54</name>
          <description>clicintattr Register</description>
          <addressOffset>0x10DA</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHV</name>
              <description>SHV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRIG</name>
              <description>TRIG</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTATTR_55</name>
          <description>clicintattr Register</description>
          <addressOffset>0x10DE</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHV</name>
              <description>SHV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRIG</name>
              <description>TRIG</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTATTR_56</name>
          <description>clicintattr Register</description>
          <addressOffset>0x10E2</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHV</name>
              <description>SHV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRIG</name>
              <description>TRIG</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTATTR_57</name>
          <description>clicintattr Register</description>
          <addressOffset>0x10E6</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHV</name>
              <description>SHV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRIG</name>
              <description>TRIG</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTATTR_58</name>
          <description>clicintattr Register</description>
          <addressOffset>0x10EA</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHV</name>
              <description>SHV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRIG</name>
              <description>TRIG</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTATTR_59</name>
          <description>clicintattr Register</description>
          <addressOffset>0x10EE</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHV</name>
              <description>SHV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRIG</name>
              <description>TRIG</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTATTR_60</name>
          <description>clicintattr Register</description>
          <addressOffset>0x10F2</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHV</name>
              <description>SHV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRIG</name>
              <description>TRIG</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTATTR_61</name>
          <description>clicintattr Register</description>
          <addressOffset>0x10F6</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHV</name>
              <description>SHV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRIG</name>
              <description>TRIG</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTATTR_62</name>
          <description>clicintattr Register</description>
          <addressOffset>0x10FA</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHV</name>
              <description>SHV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRIG</name>
              <description>TRIG</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTATTR_63</name>
          <description>clicintattr Register</description>
          <addressOffset>0x10FE</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHV</name>
              <description>SHV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRIG</name>
              <description>TRIG</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTATTR_64</name>
          <description>clicintattr Register</description>
          <addressOffset>0x1102</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHV</name>
              <description>SHV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRIG</name>
              <description>TRIG</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTATTR_65</name>
          <description>clicintattr Register</description>
          <addressOffset>0x1106</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHV</name>
              <description>SHV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRIG</name>
              <description>TRIG</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTATTR_66</name>
          <description>clicintattr Register</description>
          <addressOffset>0x110A</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHV</name>
              <description>SHV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRIG</name>
              <description>TRIG</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTATTR_67</name>
          <description>clicintattr Register</description>
          <addressOffset>0x110E</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHV</name>
              <description>SHV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRIG</name>
              <description>TRIG</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTATTR_68</name>
          <description>clicintattr Register</description>
          <addressOffset>0x1112</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHV</name>
              <description>SHV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRIG</name>
              <description>TRIG</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTATTR_69</name>
          <description>clicintattr Register</description>
          <addressOffset>0x1116</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHV</name>
              <description>SHV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRIG</name>
              <description>TRIG</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTATTR_70</name>
          <description>clicintattr Register</description>
          <addressOffset>0x111A</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHV</name>
              <description>SHV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRIG</name>
              <description>TRIG</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTATTR_71</name>
          <description>clicintattr Register</description>
          <addressOffset>0x111E</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHV</name>
              <description>SHV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRIG</name>
              <description>TRIG</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTATTR_72</name>
          <description>clicintattr Register</description>
          <addressOffset>0x1122</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHV</name>
              <description>SHV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRIG</name>
              <description>TRIG</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTATTR_73</name>
          <description>clicintattr Register</description>
          <addressOffset>0x1126</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHV</name>
              <description>SHV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRIG</name>
              <description>TRIG</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
