michaelng1129/ArduinoCore-GD32V/system/gd32vw55x/sdk/MSDK/projects/cmake/GD32VW553x.svd
        <register>
          <name>CLICINTATTR_105</name>
          <description>clicintattr Register</description>
          <addressOffset>0x11A6</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHV</name>
              <description>SHV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRIG</name>
              <description>TRIG</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTATTR_106</name>
          <description>clicintattr Register</description>
          <addressOffset>0x11AA</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHV</name>
              <description>SHV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRIG</name>
              <description>TRIG</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTATTR_107</name>
          <description>clicintattr Register</description>
          <addressOffset>0x11AE</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHV</name>
              <description>SHV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRIG</name>
              <description>TRIG</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTATTR_108</name>
          <description>clicintattr Register</description>
          <addressOffset>0x11B2</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHV</name>
              <description>SHV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRIG</name>
              <description>TRIG</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTATTR_109</name>
          <description>clicintattr Register</description>
          <addressOffset>0x11B6</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHV</name>
              <description>SHV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRIG</name>
              <description>TRIG</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTATTR_110</name>
          <description>clicintattr Register</description>
          <addressOffset>0x11BA</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHV</name>
              <description>SHV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRIG</name>
              <description>TRIG</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTATTR_111</name>
          <description>clicintattr Register</description>
          <addressOffset>0x11BE</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHV</name>
              <description>SHV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRIG</name>
              <description>TRIG</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTATTR_112</name>
          <description>clicintattr Register</description>
          <addressOffset>0x11C2</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHV</name>
              <description>SHV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRIG</name>
              <description>TRIG</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTATTR_113</name>
          <description>clicintattr Register</description>
          <addressOffset>0x11C6</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHV</name>
              <description>SHV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRIG</name>
              <description>TRIG</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTATTR_114</name>
          <description>clicintattr Register</description>
          <addressOffset>0x11CA</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHV</name>
              <description>SHV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRIG</name>
              <description>TRIG</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTATTR_115</name>
          <description>clicintattr Register</description>
          <addressOffset>0x11CE</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHV</name>
              <description>SHV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRIG</name>
              <description>TRIG</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTCTL_0</name>
          <description>clicintctl Register</description>
          <addressOffset>0x1003</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTCTL_1</name>
          <description>clicintctl Register</description>
          <addressOffset>0x1007</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTCTL_2</name>
          <description>clicintctl Register</description>
          <addressOffset>0x100B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTCTL_3</name>
          <description>clicintctl Register</description>
          <addressOffset>0x100F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTCTL_4</name>
          <description>clicintctl Register</description>
          <addressOffset>0x1013</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTCTL_5</name>
          <description>clicintctl Register</description>
          <addressOffset>0x1017</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTCTL_6</name>
          <description>clicintctl Register</description>
          <addressOffset>0x101B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTCTL_7</name>
          <description>clicintctl Register</description>
          <addressOffset>0x101F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTCTL_8</name>
          <description>clicintctl Register</description>
          <addressOffset>0x1023</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTCTL_9</name>
          <description>clicintctl Register</description>
          <addressOffset>0x1027</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTCTL_10</name>
          <description>clicintctl Register</description>
          <addressOffset>0x102B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTCTL_11</name>
          <description>clicintctl Register</description>
          <addressOffset>0x102F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTCTL_12</name>
          <description>clicintctl Register</description>
          <addressOffset>0x1033</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTCTL_13</name>
          <description>clicintctl Register</description>
          <addressOffset>0x1037</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTCTL_14</name>
          <description>clicintctl Register</description>
          <addressOffset>0x103B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTCTL_15</name>
          <description>clicintctl Register</description>
          <addressOffset>0x103F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTCTL_16</name>
          <description>clicintctl Register</description>
          <addressOffset>0x1043</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTCTL_17</name>
          <description>clicintctl Register</description>
          <addressOffset>0x1047</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTCTL_18</name>
          <description>clicintctl Register</description>
          <addressOffset>0x104B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTCTL_19</name>
          <description>clicintctl Register</description>
          <addressOffset>0x104F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTCTL_20</name>
          <description>clicintctl Register</description>
          <addressOffset>0x1053</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTCTL_21</name>
          <description>clicintctl Register</description>
          <addressOffset>0x1057</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTCTL_22</name>
          <description>clicintctl Register</description>
          <addressOffset>0x105B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTCTL_23</name>
          <description>clicintctl Register</description>
          <addressOffset>0x105F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTCTL_24</name>
          <description>clicintctl Register</description>
          <addressOffset>0x1063</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTCTL_25</name>
          <description>clicintctl Register</description>
          <addressOffset>0x1067</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
