michaelng1129/ArduinoCore-GD32V/system/gd32vw55x/sdk/MSDK/projects/cmake/GD32VW553x.svd
        <register>
          <name>CLICINTCTL_67</name>
          <description>clicintctl Register</description>
          <addressOffset>0x110F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTCTL_68</name>
          <description>clicintctl Register</description>
          <addressOffset>0x1113</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTCTL_69</name>
          <description>clicintctl Register</description>
          <addressOffset>0x1117</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTCTL_70</name>
          <description>clicintctl Register</description>
          <addressOffset>0x111B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTCTL_71</name>
          <description>clicintctl Register</description>
          <addressOffset>0x111F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTCTL_72</name>
          <description>clicintctl Register</description>
          <addressOffset>0x1123</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTCTL_73</name>
          <description>clicintctl Register</description>
          <addressOffset>0x1127</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTCTL_74</name>
          <description>clicintctl Register</description>
          <addressOffset>0x112B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTCTL_75</name>
          <description>clicintctl Register</description>
          <addressOffset>0x112F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTCTL_76</name>
          <description>clicintctl Register</description>
          <addressOffset>0x1133</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTCTL_77</name>
          <description>clicintctl Register</description>
          <addressOffset>0x1137</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTCTL_78</name>
          <description>clicintctl Register</description>
          <addressOffset>0x113B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTCTL_79</name>
          <description>clicintctl Register</description>
          <addressOffset>0x113F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTCTL_80</name>
          <description>clicintctl Register</description>
          <addressOffset>0x1143</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTCTL_81</name>
          <description>clicintctl Register</description>
          <addressOffset>0x1147</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTCTL_82</name>
          <description>clicintctl Register</description>
          <addressOffset>0x114B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTCTL_83</name>
          <description>clicintctl Register</description>
          <addressOffset>0x114F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTCTL_84</name>
          <description>clicintctl Register</description>
          <addressOffset>0x1153</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTCTL_85</name>
          <description>clicintctl Register</description>
          <addressOffset>0x1157</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTCTL_86</name>
          <description>clicintctl Register</description>
          <addressOffset>0x115B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTCTL_87</name>
          <description>clicintctl Register</description>
          <addressOffset>0x115F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTCTL_88</name>
          <description>clicintctl Register</description>
          <addressOffset>0x1163</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTCTL_89</name>
          <description>clicintctl Register</description>
          <addressOffset>0x1167</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTCTL_90</name>
          <description>clicintctl Register</description>
          <addressOffset>0x116B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTCTL_91</name>
          <description>clicintctl Register</description>
          <addressOffset>0x116F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTCTL_92</name>
          <description>clicintctl Register</description>
          <addressOffset>0x1173</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTCTL_93</name>
          <description>clicintctl Register</description>
          <addressOffset>0x1177</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTCTL_94</name>
          <description>clicintctl Register</description>
          <addressOffset>0x117B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTCTL_95</name>
          <description>clicintctl Register</description>
          <addressOffset>0x117F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTCTL_96</name>
          <description>clicintctl Register</description>
          <addressOffset>0x1183</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTCTL_97</name>
          <description>clicintctl Register</description>
          <addressOffset>0x1187</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTCTL_98</name>
          <description>clicintctl Register</description>
          <addressOffset>0x118B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTCTL_99</name>
          <description>clicintctl Register</description>
          <addressOffset>0x118F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTCTL_100</name>
          <description>clicintctl Register</description>
          <addressOffset>0x1193</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTCTL_101</name>
          <description>clicintctl Register</description>
          <addressOffset>0x1197</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTCTL_102</name>
          <description>clicintctl Register</description>
          <addressOffset>0x119B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTCTL_103</name>
          <description>clicintctl Register</description>
          <addressOffset>0x119F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTCTL_104</name>
          <description>clicintctl Register</description>
          <addressOffset>0x11A3</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTCTL_105</name>
          <description>clicintctl Register</description>
          <addressOffset>0x11A7</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTCTL_106</name>
          <description>clicintctl Register</description>
          <addressOffset>0x11AB</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLICINTCTL_107</name>
          <description>clicintctl Register</description>
          <addressOffset>0x11AF</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEVEL_PRIORITY</name>
              <description>LEVEL_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
