michaelng1129/ArduinoCore-GD32V/system/gd32vw55x/sdk/MSDK/projects/cmake/GD32VW553x.svd
        <register>
          <name>WFT6</name>
          <description>WIFI Trim register 6</description>
          <addressOffset>0x218</addressOffset>
          <size>32</size>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WIFI_TRIM</name>
              <description>After the system is reset, it is loaded from the flash</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WFT7</name>
          <description>WIFI Trim register 7</description>
          <addressOffset>0x21C</addressOffset>
          <size>32</size>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WIFI_TRIM</name>
              <description>After the system is reset, it is loaded from the flash</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WFT8</name>
          <description>WIFI Trim register 8</description>
          <addressOffset>0x220</addressOffset>
          <size>32</size>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WIFI_TRIM</name>
              <description>After the system is reset, it is loaded from the flash</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WFT9</name>
          <description>WIFI Trim register 9</description>
          <addressOffset>0x224</addressOffset>
          <size>32</size>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WIFI_TRIM</name>
              <description>After the system is reset, it is loaded from the flash</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WFT10</name>
          <description>WIFI Trim register 10</description>
          <addressOffset>0x228</addressOffset>
          <size>32</size>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WIFI_TRIM</name>
              <description>After the system is reset, it is loaded from the flash</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WFT11</name>
          <description>WIFI Trim register 11</description>
          <addressOffset>0x22C</addressOffset>
          <size>32</size>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WIFI_TRIM</name>
              <description>After the system is reset, it is loaded from the flash</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WFT12</name>
          <description>WIFI Trim register 12</description>
          <addressOffset>0x230</addressOffset>
          <size>32</size>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WIFI_TRIM</name>
              <description>After the system is reset, it is loaded from the flash</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WFT13</name>
          <description>WIFI Trim register 13</description>
          <addressOffset>0x234</addressOffset>
          <size>32</size>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WIFI_TRIM</name>
              <description>After the system is reset, it is loaded from the flash</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WFT14</name>
          <description>WIFI Trim register 14</description>
          <addressOffset>0x238</addressOffset>
          <size>32</size>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WIFI_TRIM</name>
              <description>After the system is reset, it is loaded from the flash</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WFT15</name>
          <description>WIFI Trim register 15</description>
          <addressOffset>0x23C</addressOffset>
          <size>32</size>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WIFI_TRIM</name>
              <description>After the system is reset, it is loaded from the flash</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
